<template>
	<div class="r-estimate" :class="{ open: isEstimateOpen }">
		<div
			class="r-estimate__top"
			:class="{ open: isEstimateOpen }"
			v-show="isEstimateOpen"
		>
			<button
				class="r-estimate__close"
				@click="
					isEstimateOpen = false;
					selectedEstimate = null;
				"
			>
				<img
					src="/img/icon/cross.svg"
					alt="close"
					class="r-estimate__close-icon"
				/>
			</button>

			<text-radio
				v-for="(item, index) in estimateList"
				:key="item.id"
				:designOptions="{
					accentColor: item.color,
					defaultColor: 'transparent',
					isHasBorder: true,
				}"
				:text="item.description"
				:selectedValue="selectedEstimate"
				:value="index + 1"
				radioGroup="estimate"
				v-model="selectedEstimate"
			></text-radio>
		</div>

		<div class="r-estimate__main" :class="{ open: selectedEstimate }">
			<div class="r-estimate__text-wrapper">
				<p class="r-estimate__text">
					{{ selectedEstimateFull.text }}
				</p>
			</div>
		</div>

		<div class="r-estimate__bottom">
			<r-button
				:class="{ open: isEstimateOpen }"
				v-show="selectedEstimate"
				text="Назад"
				color="black"
				@click="selectedEstimate = null"
			></r-button>
			<r-button
				:class="{ open: isEstimateOpen }"
				:color="isEstimateOpen ? 'black' : 'bordered'"
				:size="{ big: !isEstimateOpen }"
				:text="isEstimateOpen ? 'Скачать всё' : 'Получить смету'"
				@click="
					isEstimateOpen
						? (isDownloadPdf = true)
						: (isEstimateOpen = true)
				"
			></r-button>
		</div>
	</div>
</template>

<script>
	export default {
		name: "rEstimate",
		watch: {
			isDownloadPdf() {
				if (this.isDownloadPdf) {
					this.downloadPdf();
					setTimeout(() => {
						this.isDownloadPdf = false;
					}, 2000);
				}
			},
		},
		computed: {
			selectedEstimateFull() {
				return (
					this.estimateList.find(
						(el) => el.id === this.selectedEstimate
					) || {}
				);
			},
		},
		data: () => ({
			isEstimateOpen: false,
			isDownloadPdf: false,
			estimateList: [
				{
					id: 1,
					description: "Вебсайт",
					color: "#383838",
					text: `Что входит в работу?
Маркетинговое исследование:
 

Анализ целевой аудитории

Проводим созвон или встречу, которая займет 2-4 часа.

Что делаем:
-Сегментируем целевую аудиторию, выделяем платежеспособных и тех с кем хотим работать.
-Состовляем описание ЦА и потребности: Критерии выбора подрядчика.
Возражения, сомнения, барьеры.

Простым языком, разным клиентам нужно разное.

Выбрав определенную аудиторию и поняв чего они хотят на самом деле. Мы можем сразу указать на сайте ту информацию, которую ищут эти люди.

Получается не бьем пушкой по воробьям, а точечно притягиваем текстом нашу аудитории. В цифрах это сказывается на конверсии сайта из клика в заявку. 
А заявки становятся более целевые.

Анализ компании и продукта

-Компания в целом и в цифрах.
-Информация о продукте, сервисе и
условиях, выгоды, какой получают результат, кейсы.
-Детали и мелочи: уникальные материалы,
технологии, специалисты...

Все так же, нужно понять что из себя представляет продукт, который вы предоставляете. Возможно в условиях работы есть нюансы которые, важны для ваших клиентов и эту информацию нужно вынести на сайт.

Так бы люди узнали об этом, когда только начали с вами работать. А так увидят эту информацию раньше и скорее всего выберут вас среди конкурентов.

Анализ аудитории и компании с продуктом это пазл. Получив всю информацию, мы можем создать тексты, которые будут цеплять и доносить выгоду.

Контент:
Из собранной информации в исследовании, составляем главный оффер на сайте, пишем продающие текста.

Создаем прототип сайта, расположение блоков на основе UX.

Утверждаем прототип с вами.

Дизайн:
Обговариваем с вами какие варианты вам понравятся, вы предоставляете референсы того, что хотите видеть.

Дизайнер подготавливает 2 варианта дизайн макета.

Используем уникальные шрифты, подбор палитры цветов, анимации и эффекты.

Утверждаем дизайн с вами.

Программирование:
Программирование сайта

Регестрация домена

Покупка сервера

Создание форм обратной связи(чат-бот)

Интерактивность пользователя на сайте

Адаптивная версия(для телефонов)

Верстка макетов поблочно (программирование логики ресурсов, кнопок, форм и т.д)

Выгрузка сайта на сервер

Настройка рекламы:
Сбор семантического ядра, группировка ключевых фраз по рекламным компания.

Настройка рекламных компаний в РСЯ и на поиске.

Создание рекламных креативов.

Настройка аналитики, привязка конверсионных целей, вебвизора, чтобы следить на каким этапах отваливаются люди с сайта и что нужно доработать.

Во время работы компании, вычищение мусорных площадок рекламных, отсеивание не рабочих ключей.

Ведение рекламных компаний, корректировка ставок.

Оптимизация конверсии сайта

Работа и общение с тех поддержкой яндекса.

Сейчас яндекс штормит поэтому иногда надо договариваться, чтобы все нормально работало. Обьявления пропускали, модерация ускорилась и т.д

 

Что вы получаете?
Готовый продающий лендинг, нацеленный на вашу аудиторию.

Отдельные документы с исследованием компании, продукта и аудитории, можно использовать для создания отдельных презентаций, рекламных материалов, для работы с другими специалистами.

Целевые заявки заинтересованные в вашем продукте.

Докрутку конверсии сайта, чтобы улучшить стоимость заявки.

 

Время разработки от 7 до 14 дней и стоимость от 55.000 рублей до 100.000 рублей, зависит от сложности проекта и вашего запроса.`,
				},
				{
					id: 2,
					description: "Мобильное приложение",
					color: "#383838",
					text: `Что входит в работу?
Маркетинговое исследование:
 

Анализ целевой аудитории

Проводим созвон или встречу, которая займет 2-4 часа.

Что делаем:
-Сегментируем целевую аудиторию, выделяем платежеспособных и тех с кем хотим работать.
-Состовляем описание ЦА и потребности: Критерии выбора подрядчика.
Возражения, сомнения, барьеры.

Простым языком, разным клиентам нужно разное.

Выбрав определенную аудиторию и поняв чего они хотят на самом деле. Мы можем сразу указать на сайте ту информацию, которую ищут эти люди.

Получается не бьем пушкой по воробьям, а точечно притягиваем текстом нашу аудитории. В цифрах это сказывается на конверсии сайта из клика в заявку. 
А заявки становятся более целевые.

Анализ компании и продукта

-Компания в целом и в цифрах.
-Информация о продукте, сервисе и
условиях, выгоды, какой получают результат, кейсы.
-Детали и мелочи: уникальные материалы,
технологии, специалисты...

Все так же, нужно понять что из себя представляет продукт, который вы предоставляете. Возможно в условиях работы есть нюансы которые, важны для ваших клиентов и эту информацию нужно вынести на сайт.

Так бы люди узнали об этом, когда только начали с вами работать. А так увидят эту информацию раньше и скорее всего выберут вас среди конкурентов.

Анализ аудитории и компании с продуктом это пазл. Получив всю информацию, мы можем создать тексты, которые будут цеплять и доносить выгоду.

Контент:
Из собранной информации в исследовании, составляем главный оффер на сайте, пишем продающие текста.

Создаем прототип сайта, расположение блоков на основе UX.

Утверждаем прототип с вами.

Дизайн:
Обговариваем с вами какие варианты вам понравятся, вы предоставляете референсы того, что хотите видеть.

Дизайнер подготавливает 2 варианта дизайн макета.

Используем уникальные шрифты, подбор палитры цветов, анимации и эффекты.

Утверждаем дизайн с вами.

Программирование:
Программирование сайта

Регестрация домена

Покупка сервера

Создание форм обратной связи(чат-бот)

Интерактивность пользователя на сайте

Адаптивная версия(для телефонов)

Верстка макетов поблочно (программирование логики ресурсов, кнопок, форм и т.д)

Выгрузка сайта на сервер

Настройка рекламы:
Сбор семантического ядра, группировка ключевых фраз по рекламным компания.

Настройка рекламных компаний в РСЯ и на поиске.

Создание рекламных креативов.

Настройка аналитики, привязка конверсионных целей, вебвизора, чтобы следить на каким этапах отваливаются люди с сайта и что нужно доработать.

Во время работы компании, вычищение мусорных площадок рекламных, отсеивание не рабочих ключей.

Ведение рекламных компаний, корректировка ставок.

Оптимизация конверсии сайта

Работа и общение с тех поддержкой яндекса.

Сейчас яндекс штормит поэтому иногда надо договариваться, чтобы все нормально работало. Обьявления пропускали, модерация ускорилась и т.д

 

Что вы получаете?
Готовый продающий лендинг, нацеленный на вашу аудиторию.

Отдельные документы с исследованием компании, продукта и аудитории, можно использовать для создания отдельных презентаций, рекламных материалов, для работы с другими специалистами.

Целевые заявки заинтересованные в вашем продукте.

Докрутку конверсии сайта, чтобы улучшить стоимость заявки.

 

Время разработки от 7 до 14 дней и стоимость от 55.000 рублей до 100.000 рублей, зависит от сложности проекта и вашего запроса.`,
				},
				{
					id: 3,
					description: "Личный кабинет",
					color: "#383838",
					text: `Что входит в работу?
Маркетинговое исследование:
 

Анализ целевой аудитории

Проводим созвон или встречу, которая займет 2-4 часа.

Что делаем:
-Сегментируем целевую аудиторию, выделяем платежеспособных и тех с кем хотим работать.
-Состовляем описание ЦА и потребности: Критерии выбора подрядчика.
Возражения, сомнения, барьеры.

Простым языком, разным клиентам нужно разное.

Выбрав определенную аудиторию и поняв чего они хотят на самом деле. Мы можем сразу указать на сайте ту информацию, которую ищут эти люди.

Получается не бьем пушкой по воробьям, а точечно притягиваем текстом нашу аудитории. В цифрах это сказывается на конверсии сайта из клика в заявку. 
А заявки становятся более целевые.

Анализ компании и продукта

-Компания в целом и в цифрах.
-Информация о продукте, сервисе и
условиях, выгоды, какой получают результат, кейсы.
-Детали и мелочи: уникальные материалы,
технологии, специалисты...

Все так же, нужно понять что из себя представляет продукт, который вы предоставляете. Возможно в условиях работы есть нюансы которые, важны для ваших клиентов и эту информацию нужно вынести на сайт.

Так бы люди узнали об этом, когда только начали с вами работать. А так увидят эту информацию раньше и скорее всего выберут вас среди конкурентов.

Анализ аудитории и компании с продуктом это пазл. Получив всю информацию, мы можем создать тексты, которые будут цеплять и доносить выгоду.

Контент:
Из собранной информации в исследовании, составляем главный оффер на сайте, пишем продающие текста.

Создаем прототип сайта, расположение блоков на основе UX.

Утверждаем прототип с вами.

Дизайн:
Обговариваем с вами какие варианты вам понравятся, вы предоставляете референсы того, что хотите видеть.

Дизайнер подготавливает 2 варианта дизайн макета.

Используем уникальные шрифты, подбор палитры цветов, анимации и эффекты.

Утверждаем дизайн с вами.

Программирование:
Программирование сайта

Регестрация домена

Покупка сервера

Создание форм обратной связи(чат-бот)

Интерактивность пользователя на сайте

Адаптивная версия(для телефонов)

Верстка макетов поблочно (программирование логики ресурсов, кнопок, форм и т.д)

Выгрузка сайта на сервер

Настройка рекламы:
Сбор семантического ядра, группировка ключевых фраз по рекламным компания.

Настройка рекламных компаний в РСЯ и на поиске.

Создание рекламных креативов.

Настройка аналитики, привязка конверсионных целей, вебвизора, чтобы следить на каким этапах отваливаются люди с сайта и что нужно доработать.

Во время работы компании, вычищение мусорных площадок рекламных, отсеивание не рабочих ключей.

Ведение рекламных компаний, корректировка ставок.

Оптимизация конверсии сайта

Работа и общение с тех поддержкой яндекса.

Сейчас яндекс штормит поэтому иногда надо договариваться, чтобы все нормально работало. Обьявления пропускали, модерация ускорилась и т.д

 

Что вы получаете?
Готовый продающий лендинг, нацеленный на вашу аудиторию.

Отдельные документы с исследованием компании, продукта и аудитории, можно использовать для создания отдельных презентаций, рекламных материалов, для работы с другими специалистами.

Целевые заявки заинтересованные в вашем продукте.

Докрутку конверсии сайта, чтобы улучшить стоимость заявки.

 

Время разработки от 7 до 14 дней и стоимость от 55.000 рублей до 100.000 рублей, зависит от сложности проекта и вашего запроса.`,
				},
				{
					id: 4,
					description: "Внутренний продукт",
					color: "#383838",
					text: `Что входит в работу?
Маркетинговое исследование:
 

Анализ целевой аудитории

Проводим созвон или встречу, которая займет 2-4 часа.

Что делаем:
-Сегментируем целевую аудиторию, выделяем платежеспособных и тех с кем хотим работать.
-Состовляем описание ЦА и потребности: Критерии выбора подрядчика.
Возражения, сомнения, барьеры.

Простым языком, разным клиентам нужно разное.

Выбрав определенную аудиторию и поняв чего они хотят на самом деле. Мы можем сразу указать на сайте ту информацию, которую ищут эти люди.

Получается не бьем пушкой по воробьям, а точечно притягиваем текстом нашу аудитории. В цифрах это сказывается на конверсии сайта из клика в заявку. 
А заявки становятся более целевые.

Анализ компании и продукта

-Компания в целом и в цифрах.
-Информация о продукте, сервисе и
условиях, выгоды, какой получают результат, кейсы.
-Детали и мелочи: уникальные материалы,
технологии, специалисты...

Все так же, нужно понять что из себя представляет продукт, который вы предоставляете. Возможно в условиях работы есть нюансы которые, важны для ваших клиентов и эту информацию нужно вынести на сайт.

Так бы люди узнали об этом, когда только начали с вами работать. А так увидят эту информацию раньше и скорее всего выберут вас среди конкурентов.

Анализ аудитории и компании с продуктом это пазл. Получив всю информацию, мы можем создать тексты, которые будут цеплять и доносить выгоду.

Контент:
Из собранной информации в исследовании, составляем главный оффер на сайте, пишем продающие текста.

Создаем прототип сайта, расположение блоков на основе UX.

Утверждаем прототип с вами.

Дизайн:
Обговариваем с вами какие варианты вам понравятся, вы предоставляете референсы того, что хотите видеть.

Дизайнер подготавливает 2 варианта дизайн макета.

Используем уникальные шрифты, подбор палитры цветов, анимации и эффекты.

Утверждаем дизайн с вами.

Программирование:
Программирование сайта

Регестрация домена

Покупка сервера

Создание форм обратной связи(чат-бот)

Интерактивность пользователя на сайте

Адаптивная версия(для телефонов)

Верстка макетов поблочно (программирование логики ресурсов, кнопок, форм и т.д)

Выгрузка сайта на сервер

Настройка рекламы:
Сбор семантического ядра, группировка ключевых фраз по рекламным компания.

Настройка рекламных компаний в РСЯ и на поиске.

Создание рекламных креативов.

Настройка аналитики, привязка конверсионных целей, вебвизора, чтобы следить на каким этапах отваливаются люди с сайта и что нужно доработать.

Во время работы компании, вычищение мусорных площадок рекламных, отсеивание не рабочих ключей.

Ведение рекламных компаний, корректировка ставок.

Оптимизация конверсии сайта

Работа и общение с тех поддержкой яндекса.

Сейчас яндекс штормит поэтому иногда надо договариваться, чтобы все нормально работало. Обьявления пропускали, модерация ускорилась и т.д

 

Что вы получаете?
Готовый продающий лендинг, нацеленный на вашу аудиторию.

Отдельные документы с исследованием компании, продукта и аудитории, можно использовать для создания отдельных презентаций, рекламных материалов, для работы с другими специалистами.

Целевые заявки заинтересованные в вашем продукте.

Докрутку конверсии сайта, чтобы улучшить стоимость заявки.

 

Время разработки от 7 до 14 дней и стоимость от 55.000 рублей до 100.000 рублей, зависит от сложности проекта и вашего запроса.`,
				},
				{
					id: 5,
					description: "Бренд для компании или продукта",
					color: "#383838",
					text: `Что входит в работу?
Маркетинговое исследование:
 

Анализ целевой аудитории

Проводим созвон или встречу, которая займет 2-4 часа.

Что делаем:
-Сегментируем целевую аудиторию, выделяем платежеспособных и тех с кем хотим работать.
-Состовляем описание ЦА и потребности: Критерии выбора подрядчика.
Возражения, сомнения, барьеры.

Простым языком, разным клиентам нужно разное.

Выбрав определенную аудиторию и поняв чего они хотят на самом деле. Мы можем сразу указать на сайте ту информацию, которую ищут эти люди.

Получается не бьем пушкой по воробьям, а точечно притягиваем текстом нашу аудитории. В цифрах это сказывается на конверсии сайта из клика в заявку. 
А заявки становятся более целевые.

Анализ компании и продукта

-Компания в целом и в цифрах.
-Информация о продукте, сервисе и
условиях, выгоды, какой получают результат, кейсы.
-Детали и мелочи: уникальные материалы,
технологии, специалисты...

Все так же, нужно понять что из себя представляет продукт, который вы предоставляете. Возможно в условиях работы есть нюансы которые, важны для ваших клиентов и эту информацию нужно вынести на сайт.

Так бы люди узнали об этом, когда только начали с вами работать. А так увидят эту информацию раньше и скорее всего выберут вас среди конкурентов.

Анализ аудитории и компании с продуктом это пазл. Получив всю информацию, мы можем создать тексты, которые будут цеплять и доносить выгоду.

Контент:
Из собранной информации в исследовании, составляем главный оффер на сайте, пишем продающие текста.

Создаем прототип сайта, расположение блоков на основе UX.

Утверждаем прототип с вами.

Дизайн:
Обговариваем с вами какие варианты вам понравятся, вы предоставляете референсы того, что хотите видеть.

Дизайнер подготавливает 2 варианта дизайн макета.

Используем уникальные шрифты, подбор палитры цветов, анимации и эффекты.

Утверждаем дизайн с вами.

Программирование:
Программирование сайта

Регестрация домена

Покупка сервера

Создание форм обратной связи(чат-бот)

Интерактивность пользователя на сайте

Адаптивная версия(для телефонов)

Верстка макетов поблочно (программирование логики ресурсов, кнопок, форм и т.д)

Выгрузка сайта на сервер

Настройка рекламы:
Сбор семантического ядра, группировка ключевых фраз по рекламным компания.

Настройка рекламных компаний в РСЯ и на поиске.

Создание рекламных креативов.

Настройка аналитики, привязка конверсионных целей, вебвизора, чтобы следить на каким этапах отваливаются люди с сайта и что нужно доработать.

Во время работы компании, вычищение мусорных площадок рекламных, отсеивание не рабочих ключей.

Ведение рекламных компаний, корректировка ставок.

Оптимизация конверсии сайта

Работа и общение с тех поддержкой яндекса.

Сейчас яндекс штормит поэтому иногда надо договариваться, чтобы все нормально работало. Обьявления пропускали, модерация ускорилась и т.д

 

Что вы получаете?
Готовый продающий лендинг, нацеленный на вашу аудиторию.

Отдельные документы с исследованием компании, продукта и аудитории, можно использовать для создания отдельных презентаций, рекламных материалов, для работы с другими специалистами.

Целевые заявки заинтересованные в вашем продукте.

Докрутку конверсии сайта, чтобы улучшить стоимость заявки.

 

Время разработки от 7 до 14 дней и стоимость от 55.000 рублей до 100.000 рублей, зависит от сложности проекта и вашего запроса.`,
				},
				{
					id: 6,
					description: "Дизайн система",
					color: "#383838",
					text: `Что входит в работу?
Маркетинговое исследование:
 

Анализ целевой аудитории

Проводим созвон или встречу, которая займет 2-4 часа.

Что делаем:
-Сегментируем целевую аудиторию, выделяем платежеспособных и тех с кем хотим работать.
-Состовляем описание ЦА и потребности: Критерии выбора подрядчика.
Возражения, сомнения, барьеры.

Простым языком, разным клиентам нужно разное.

Выбрав определенную аудиторию и поняв чего они хотят на самом деле. Мы можем сразу указать на сайте ту информацию, которую ищут эти люди.

Получается не бьем пушкой по воробьям, а точечно притягиваем текстом нашу аудитории. В цифрах это сказывается на конверсии сайта из клика в заявку. 
А заявки становятся более целевые.

Анализ компании и продукта

-Компания в целом и в цифрах.
-Информация о продукте, сервисе и
условиях, выгоды, какой получают результат, кейсы.
-Детали и мелочи: уникальные материалы,
технологии, специалисты...

Все так же, нужно понять что из себя представляет продукт, который вы предоставляете. Возможно в условиях работы есть нюансы которые, важны для ваших клиентов и эту информацию нужно вынести на сайт.

Так бы люди узнали об этом, когда только начали с вами работать. А так увидят эту информацию раньше и скорее всего выберут вас среди конкурентов.

Анализ аудитории и компании с продуктом это пазл. Получив всю информацию, мы можем создать тексты, которые будут цеплять и доносить выгоду.

Контент:
Из собранной информации в исследовании, составляем главный оффер на сайте, пишем продающие текста.

Создаем прототип сайта, расположение блоков на основе UX.

Утверждаем прототип с вами.

Дизайн:
Обговариваем с вами какие варианты вам понравятся, вы предоставляете референсы того, что хотите видеть.

Дизайнер подготавливает 2 варианта дизайн макета.

Используем уникальные шрифты, подбор палитры цветов, анимации и эффекты.

Утверждаем дизайн с вами.

Программирование:
Программирование сайта

Регестрация домена

Покупка сервера

Создание форм обратной связи(чат-бот)

Интерактивность пользователя на сайте

Адаптивная версия(для телефонов)

Верстка макетов поблочно (программирование логики ресурсов, кнопок, форм и т.д)

Выгрузка сайта на сервер

Настройка рекламы:
Сбор семантического ядра, группировка ключевых фраз по рекламным компания.

Настройка рекламных компаний в РСЯ и на поиске.

Создание рекламных креативов.

Настройка аналитики, привязка конверсионных целей, вебвизора, чтобы следить на каким этапах отваливаются люди с сайта и что нужно доработать.

Во время работы компании, вычищение мусорных площадок рекламных, отсеивание не рабочих ключей.

Ведение рекламных компаний, корректировка ставок.

Оптимизация конверсии сайта

Работа и общение с тех поддержкой яндекса.

Сейчас яндекс штормит поэтому иногда надо договариваться, чтобы все нормально работало. Обьявления пропускали, модерация ускорилась и т.д

 

Что вы получаете?
Готовый продающий лендинг, нацеленный на вашу аудиторию.

Отдельные документы с исследованием компании, продукта и аудитории, можно использовать для создания отдельных презентаций, рекламных материалов, для работы с другими специалистами.

Целевые заявки заинтересованные в вашем продукте.

Докрутку конверсии сайта, чтобы улучшить стоимость заявки.

 

Время разработки от 7 до 14 дней и стоимость от 55.000 рублей до 100.000 рублей, зависит от сложности проекта и вашего запроса.`,
				},
			],

			selectedEstimate: null,
		}),
		methods: {
			async downloadPdf() {
				console.log("download");
			},
		},
	};
</script>

<style lang="scss" scoped>
	@import "@/assets/scss/variables";

	.r-estimate {
		background-color: transparent;
		transition: all 0.3s ease;
		&.open {
			background-color: $white;
			padding: 6rem;
			border-radius: 4.8rem;
			@media (max-width: 767px) {
				padding: 3rem 2rem;
				border-radius: 2rem;
			}
		}

		&__close {
			background-color: transparent;
			position: absolute;
			right: 0;
			top: 0;
			@media (max-width: 540px) {
				position: static;
				margin-left: auto;
			}

			&-icon {
				width: 3rem;
				height: 3rem;
				@media (max-width: 767px) {
					width: 2rem;
					height: 2rem;
				}
			}
		}

		&__top {
			position: relative;
			padding-right: 5rem;
			display: flex;
			flex-wrap: wrap;
			gap: 2rem;
			&.open {
				margin-bottom: 3rem;

				@media (max-width: 540px) {
					flex-direction: column;
					padding-right: 0;
				}
			}
		}
		&__main {
			border: 0.2rem solid transparent;
			padding: 0 1.5rem 0 6rem;
			&.open {
				margin-bottom: 7rem;
				border-color: $dark;
				border-radius: 3rem;
				padding: 6rem 1.5rem 6rem 6rem;
				@media (max-width: 767px) {
					padding: 2rem 1.5rem 2rem 1.5rem;
					margin-bottom: 3rem;
					border-radius: 2rem;
				}
			}
		}
		&__text {
			white-space: pre-wrap;
			font-size: 2.4rem;
			@media (max-width: 767px) {
				font-size: 1.8rem;
			}
			&-wrapper {
				max-height: 60rem;
				overflow-y: auto;
				padding-right: 4.5rem;
				@media (max-width: 767px) {
					padding-right: 1rem;
				}

				//* chrome/safari
				&::-webkit-scrollbar-track {
					background: transparent; /* цвет дорожки */
				}
				&::-webkit-scrollbar-thumb {
					background-color: rgba($dark, 0.2); /* цвет плашки */
				}
				//* firefox
				scrollbar-width: thin; /* "auto" или "thin"  */
				scrollbar-color: rgba($dark, 0.2) transparent;
			}
		}

		&__bottom {
			display: flex;
			gap: 2rem;
			@media (max-width: 470px) {
				flex-direction: column;
			}
		}

		.r-button {
			width: 100%;
			&.open {
				font-size: 2.4rem;
				@media (max-width: 767px) {
					font-size: 1.8rem;
					padding: 2rem;
				}
			}
			&:first-child {
				width: max-content;
				@media (max-width: 470px) {
					width: inherit;
				}
			}
		}
	}
</style>
